#pragma once

#pragma region Material/Font_s
struct MaterialInfo
{
	const char* name;
};

struct Material
{
	MaterialInfo info;
};

struct Glyph
{
	uint16_t letter;
	char x0;
	char y0;
	char dx;
	char pixelWidth;
	char pixelHeight;
	float s0;
	float t0;
	float s1;
	float t1;
};

struct Font_s
{
	const char* fontName;
	int pixelHeight;
	int glyphCount;
	Material* material;
	Material* glowMaterial;
	Glyph* glyphs;
};
#pragma endregion

#pragma region UiContext
class UiContext
{
public:
	int32_t localClientNum; //0x0000
	char pad_0004[4]; //0x0004
	int32_t realTime; //0x0008
	int32_t frameTime; //0x000C
	char pad_0010[12]; //0x0010
	int32_t screenWidth; //0x001C
	int32_t screenHeight; //0x0020
	float screenAspect; //0x0024
	float FPS; //0x0028
}; //Size: 0x002C
extern UiContext* cgDc;
#pragma endregion

#pragma region ScreenPlacement
struct ScreenPlacement
{
	float scaleVirtualToReal[2];
	float scaleVirtualToFull[2];
	float scaleRealToVirtual[2];
	float realViewportPosition[2];
	float realViewportSize[2];
	float virtualViewableMin[2];
	float virtualViewableMax[2];
	float realViewableMin[2];
	float realViewableMax[2];
	float virtualAdjustableMin[2];
	float virtualAdjustableMax[2];
	float realAdjustableMin[2];
	float realAdjustableMax[2];
	float subScreenLeft;
};
extern ScreenPlacement* scrPlaceView;
#pragma endregion

#pragma region XAsset
enum XAssetType
{
	ASSET_TYPE_PHYSPRESET,
	ASSET_TYPE_PHYSCONSTRAINTS,
	ASSET_TYPE_DESTRUCTIBLEDEF,
	ASSET_TYPE_XANIM,
	ASSET_TYPE_XMODEL,
	ASSET_TYPE_XMODELMESH,
	ASSET_TYPE_MATERIAL,
	ASSET_TYPE_PIXELSHADER,
	ASSET_TYPE_VERTEXSHADER,
	ASSET_TYPE_TECHSET,
	ASSET_TYPE_IMAGE,
	ASSET_TYPE_SOUND,
	ASSET_TYPE_SOUND_PATCH,
	ASSET_TYPE_COL_MAP,
	ASSET_TYPE_COM_MAP,
	ASSET_TYPE_GAME_MAP,
	ASSET_TYPE_MAP_ENTS,
	ASSET_TYPE_GFX_MAP,
	ASSET_TYPE_LIGHTDEF,
	ASSET_TYPE_LENSFLAREDEF,
	ASSET_TYPE_UI_MAP,
	ASSET_TYPE_FONT,
	ASSET_TYPE_FONTICON,
	ASSET_TYPE_LOCALIZE,
	ASSET_TYPE_WEAPON,
	ASSET_TYPE_WEAPONDEF,
	ASSET_TYPE_WEAPONVARIANT,
	ASSET_TYPE_WEAPONFULL,
	ASSET_TYPE_CGMEDIATABLE,
	ASSET_TYPE_PLAYERSOUNDSTABLE,
	ASSET_TYPE_PLAYERFXTABLE,
	ASSET_TYPE_SHAREDWEAPONSOUNDS,
	ASSET_TYPE_ATTACHMENT,
	ASSET_TYPE_ATTACHMENTUNIQUE,
	ASSET_TYPE_WEAPONCAMO,
	ASSET_TYPE_CUSTOMIZATIONTABLE,
	ASSET_TYPE_CUSTOMIZATIONTABLE_FEIMAGES,
	ASSET_TYPE_CUSTOMIZATIONTABLECOLOR,
	ASSET_TYPE_SNDDRIVERGLOBALS,
	ASSET_TYPE_FX,
	ASSET_TYPE_FX_ALIAS,
	ASSET_TYPE_TAGFX,
	ASSET_TYPE_KLF,
	ASSET_TYPE_IMPACTSFXTABLE,
	ASSET_TYPE_IMPACTSOUNDSTABLE,
	ASSET_TYPE_PLAYER_CHARACTER,
	ASSET_TYPE_AITYPE,
	ASSET_TYPE_CHARACTER,
	ASSET_TYPE_XMODELALIAS,
	ASSET_TYPE_RAWFILE,
	ASSET_TYPE_STRINGTABLE,
	ASSET_TYPE_STRUCTUREDTABLE,
	ASSET_TYPE_LEADERBOARDDEF,
	ASSET_TYPE_DDL,
	ASSET_TYPE_GLASSES,
	ASSET_TYPE_TEXTURELIST,
	ASSET_TYPE_SCRIPTPARSETREE,
	ASSET_TYPE_KEYVALUEPAIRS,
	ASSET_TYPE_VEHICLE,
	ASSET_TYPE_ADDON_MAP_ENTS,
	ASSET_TYPE_TRACER,
	ASSET_TYPE_SKINNEDVERTS,
	ASSET_TYPE_SLUG,
	ASSET_TYPE_SURFACEFXTABLE,
	ASSET_TYPE_SURFACESOUNDDEF,
	ASSET_TYPE_FOOTSTEPTABLE,
	ASSET_TYPE_ENTITYFXIMPACTS,
	ASSET_TYPE_ENTITYSOUNDIMPACTS,
	ASSET_TYPE_ZBARRIER,
	ASSET_TYPE_VEHICLEFXDEF,
	ASSET_TYPE_VEHICLESOUNDDEF,
	ASSET_TYPE_TYPEINFO,
	ASSET_TYPE_SCRIPTBUNDLE,
	ASSET_TYPE_SCRIPTBUNDLELIST,
	ASSET_TYPE_RUMBLE,
	ASSET_TYPE_BULLETPENETRATION,
	ASSET_TYPE_LOCDMGTABLE,
	ASSET_TYPE_AIMTABLE,
	ASSET_TYPE_ANIMSELECTORTABLE,
	ASSET_TYPE_ANIMMAPPINGTABLE,
	ASSET_TYPE_ANIMSTATEMACHINE,
	ASSET_TYPE_BEHAVIORTREE,
	ASSET_TYPE_BEHAVIORSTATEMACHINE,
	ASSET_TYPE_TTF,
	ASSET_TYPE_LIGHTDESCRIPTION,
	ASSET_TYPE_SHELLSHOCK,
	ASSET_TYPE_XCAM,
	ASSET_TYPE_BGCACHE,
	ASSET_TYPE_TEXTURECOMBO,
	ASSET_TYPE_FLAMETABLE,
	ASSET_TYPE_BITFIELD,
	ASSET_TYPE_ATTACHMENTCOSMETICVARIANT,
	ASSET_TYPE_MAPTABLE,
	ASSET_TYPE_MAPTABLELOADINGIMAGES,
	ASSET_TYPE_MEDAL,
	ASSET_TYPE_MEDALTABLE,
	ASSET_TYPE_OBJECTIVE,
	ASSET_TYPE_OBJECTIVELIST,
	ASSET_TYPE_UMBRA_TOME,
	ASSET_TYPE_NAVMESH,
	ASSET_TYPE_NAVVOLUME,
	ASSET_TYPE_BINARYHTML,
	ASSET_TYPE_LASER,
	ASSET_TYPE_BEAM,
	ASSET_TYPE_STREAMERHINT,
	ASSET_TYPE_TEXTURE_ATLAS,
	ASSET_TYPE_GFX_MAP_TRZONE,
	ASSET_TYPE_COL_MAP_TRZONE,
	ASSET_TYPE_STRING,
	ASSET_TYPE_ASSETLIST,
	ASSET_TYPE_REPORT,
	ASSET_TYPE_DEPEND,
};
#pragma endregion